In [6]:
#Pandas is a powerful data manipulation library in python, widely used in data analysis ad data cleaning
import pandas as pd

In [7]:
## series
## series is a one-dimensional labeled array capable of holding any data type
data = [1,2,3,4,5]
series = pd.Series(data)
print("Series: \n",series)
print(type(series))

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [8]:
## create a series from a dictionary
data = {'a':0,'b':1,'c':2,'d':3,'e':4}
series = pd.Series(data)
print("Series: \n",series)
#print(type(series))

Series:
 a    0
b    1
c    2
d    3
e    4
dtype: int64

In [10]:
data = [10,20,30,40,50]
index = ['a','b','c','d','e']

pd.Series(data,index = index)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [13]:
## dataframe
## dataframe is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns

##create a dataframe from a dictionary of list
data = {
    'Name': ['Richard','Otwoma','Lano'],
    'Age': [21,22,23],
    'city':['Nairobi','lagos','zanzibar'],
    'Gender': ['M','M','M']
}

df = pd.DataFrame(data)
print(df) 
print(type(df))

      Name  Age      city Gender
0  Richard   21   Nairobi      M
1   Otwoma   22     lagos      M
2     Lano   23  zanzibar      M
<class 'pandas.core.frame.DataFrame'>

In [14]:
import numpy as np

np.array(df)

array([['Richard', 21, 'Nairobi', 'M'],
       ['Otwoma', 22, 'lagos', 'M'],
       ['Lano', 23, 'zanzibar', 'M']], dtype=object)

In [15]:
## create a df from a list of dictionaries

data = [
    {'Name':'Richard','Age':21,'city':'Nairobi','Gender':'M'},
    {'Name':'Otwoma','Age':22,'city':'lagos','Gender':'M'},
    {'Name':'Lano','Age':23,'city':'zanzibar','Gender':'M'}
]
df = pd.DataFrame(data)
print(df) 
print(type(df))

      Name  Age      city Gender
0  Richard   21   Nairobi      M
1   Otwoma   22     lagos      M
2     Lano   23  zanzibar      M
<class 'pandas.core.frame.DataFrame'>

In [24]:
df = pd.read_csv('E:\Complete-Data-Science-Machine-Learning-DL-NLP-Bootcamp\Cryptocurrency Historical Prices\coin_Bitcoin.csv')
print(df.head(5))

   SNo     Name Symbol                 Date        High         Low  \
0    1  Bitcoin    BTC  2013-04-29 23:59:59  147.488007  134.000000
1    2  Bitcoin    BTC  2013-04-30 23:59:59  146.929993  134.050003
2    3  Bitcoin    BTC  2013-05-01 23:59:59  139.889999  107.720001
3    4  Bitcoin    BTC  2013-05-02 23:59:59  125.599998   92.281898
4    5  Bitcoin    BTC  2013-05-03 23:59:59  108.127998   79.099998

         Open       Close  Volume     Marketcap
0  134.444000  144.539993     0.0  1.603769e+09
1  144.000000  139.000000     0.0  1.542813e+09
2  139.000000  116.989998     0.0  1.298955e+09
3  116.379997  105.209999     0.0  1.168517e+09
4  106.250000   97.750000     0.0  1.085995e+09

In [25]:
df.tail(5)

,SNo,Name,Symbol,Date,High,Low,Open,Close,Volume,Marketcap
2986,2987,Bitcoin,BTC,2021-07-02 23:59:59,33939.588699,32770.680780,33549.600177,33897.048590,3.872897e+10,6.354508e+11
2987,2988,Bitcoin,BTC,2021-07-03 23:59:59,34909.259899,33402.696536,33854.421362,34668.548402,2.438396e+10,6.499397e+11
2988,2989,Bitcoin,BTC,2021-07-04 23:59:59,35937.567147,34396.477458,34665.564866,35287.779766,2.492431e+10,6.615748e+11
2989,2990,Bitcoin,BTC,2021-07-05 23:59:59,35284.344430,33213.661034,35284.344430,33746.002456,2.672155e+10,6.326962e+11
2990,2991,Bitcoin,BTC,2021-07-06 23:59:59,35038.536363,33599.916169,33723.509655,34235.193451,2.650126e+10,6.418992e+11

In [29]:
## Accessing data from data frame
data = pd.DataFrame(data)
print(data) 
print(type(data))

      Name  Age      city Gender
0  Richard   21   Nairobi      M
1   Otwoma   22     lagos      M
2     Lano   23  zanzibar      M
<class 'pandas.core.frame.DataFrame'>

In [30]:
data

      Name  Age      city Gender
0  Richard   21   Nairobi      M
1   Otwoma   22     lagos      M
2     Lano   23  zanzibar      M

In [31]:
df

      Name  Age      city Gender
0  Richard   21   Nairobi      M
1   Otwoma   22     lagos      M
2     Lano   23  zanzibar      M

In [33]:
df['Name']

0    Richard
1     Otwoma
2       Lano
Name: Name, dtype: object

In [34]:
df.loc[0]

Name      Richard
Age            21
city      Nairobi
Gender          M
Name: 0, dtype: object

In [35]:
df.iloc[0]

Name      Richard
Age            21
city      Nairobi
Gender          M
Name: 0, dtype: object

In [36]:
df.loc[0][0]

C:\Users\ronya\AppData\Local\Temp\ipykernel_13120\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Richard'

In [37]:
## Accessing specified element
df.at[1,'Age']

np.int64(22)

In [38]:
## Accesing a specified elelment using iat
df.iat[1,1]

np.int64(22)

In [39]:
### Data manupulaion with dataframes
df

      Name  Age      city Gender
0  Richard   21   Nairobi      M
1   Otwoma   22     lagos      M
2     Lano   23  zanzibar      M

In [40]:
## Adding a column
df['Salary'] = [10000,20000,30000]

df

      Name  Age      city Gender  Salary
0  Richard   21   Nairobi      M   10000
1   Otwoma   22     lagos      M   20000
2     Lano   23  zanzibar      M   30000

In [43]:
## Remove a column
df.drop('Salary',axis=1, inplace=True)  #axis=1 means column, inplace=true means permanent

df

      Name  Age      city Gender
0  Richard   21   Nairobi      M
1   Otwoma   22     lagos      M
2     Lano   23  zanzibar      M

In [47]:
## Add age to a column
df['Age'] = df['Age'] + 1

df

      Name  Age      city Gender
0  Richard   25   Nairobi      M
1   Otwoma   26     lagos      M
2     Lano   27  zanzibar      M

In [ ]:
df.drop(0,inplace=True)

KeyError: '[0] not found in axis'

In [50]:
df

     Name  Age      city Gender
1  Otwoma   26     lagos      M
2    Lano   27  zanzibar      M

In [51]:
# print data type
print(df.dtypes)

Name      object
Age        int64
city      object
Gender    object
dtype: object

In [52]:
## statistical analysis
print(df.describe())

             Age
count   2.000000
mean   26.500000
std     0.707107
min    26.000000
25%    26.250000
50%    26.500000
75%    26.750000
max    27.000000